In [1]:
from sqlalchemy import create_engine
engine=create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [2]:
import pandas as pd

In [13]:
"""  QUESTIONS:
/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */  """

sql_q10='''SELECT name, sum(sub.revenue) as total_revenue
FROM (SELECT name, CASE WHEN memid!=0 THEN slots*membercost ELSE slots*guestcost END as `revenue`
FROM `Bookings` 
LEFT JOIN `Facilities` on Bookings.`facid`=Facilities.`facid`) as sub
group by name
/* Can't use where after regrouping.Need to use having */
having (total_revenue<=1000)
ORDER BY total_revenue
'''

In [14]:
df=pd.read_sql_query(sql_q10,engine)

In [15]:
print(df)

            name  total_revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

In [17]:
"""/* Q11: Produce a report of members and who recommended them 
in alphabetic surname,firstname order */
"""
    
sql_q11='''SELECT m1.surname as surname,m1.firstname as firstname, m2.surname as rec_surname, m2.firstname as rec_firstname
FROM Members as m1
INNER JOIN Members as m2 on m1.recommendedby =m2.memid
WHERE m1.recommendedby IS NOT NULL and m1.recommendedby!=0
ORDER BY surname,firstname'''

In [19]:
df=pd.read_sql_query(sql_q11,engine)
print(df)

              surname  firstname rec_surname rec_firstname
0               Bader   Florence    Stibbons        Ponder
1               Baker       Anne    Stibbons        Ponder
2               Baker    Timothy     Farrell        Jemima
3              Boothe        Tim      Rownam           Tim
4             Butters     Gerald       Smith        Darren
5              Coplin       Joan       Baker       Timothy
6             Crumpet      Erica       Smith         Tracy
7                Dare      Nancy    Joplette        Janice
8             Genting    Matthew     Butters        Gerald
9                Hunt       John     Purview     Millicent
10              Jones      David    Joplette        Janice
11              Jones    Douglas       Jones         David
12           Joplette     Janice       Smith        Darren
13          Mackenzie       Anna       Smith        Darren
14               Owen    Charles       Smith        Darren
15             Pinker      David     Farrell        Jemima
16            Purview  Millicent       Smith         Tracy
17             Rumney  Henrietta     Genting       Matthew
18             Sarwin  Ramnaresh       Bader      Florence
19              Smith       Jack       Smith        Darren
20           Stibbons     Ponder       Tracy        Burton
21  Worthington-Smyth      Henry       Smith         Tracy

In [21]:
"""/* Q12: Find the facilities with their usage by member, 
but not guests */"""


sql_q12='''SELECT name,COUNT(*) as `Usage`
FROM `Bookings` 
LEFT JOIN Facilities on Bookings.facid=Facilities.facid
WHERE memid!=0
GROUP BY name

'''

In [22]:
df=pd.read_sql_query(sql_q12,engine)
print(df)

              name  Usage
0  Badminton Court    344
1   Massage Room 1    421
2   Massage Room 2     27
3       Pool Table    783
4    Snooker Table    421
5     Squash Court    195
6     Table Tennis    385
7   Tennis Court 1    308
8   Tennis Court 2    276

In [29]:
"""/* Q13: Find the facilities usage by month, but not guests */

"""

sql_q13='''SELECT name,STRFTIME('%m', starttime) AS month,COUNT(*) as `Usage`
FROM `Bookings` 
LEFT JOIN Facilities on Bookings.facid=Facilities.facid
WHERE memid!=0
GROUP BY name,month
'''

In [30]:
df=pd.read_sql_query(sql_q13,engine)
print(df)

               name month  Usage
0   Badminton Court    07     51
1   Badminton Court    08    132
2   Badminton Court    09    161
3    Massage Room 1    07     77
4    Massage Room 1    08    153
5    Massage Room 1    09    191
6    Massage Room 2    07      4
7    Massage Room 2    08      9
8    Massage Room 2    09     14
9        Pool Table    07    103
10       Pool Table    08    272
11       Pool Table    09    408
12    Snooker Table    07     68
13    Snooker Table    08    154
14    Snooker Table    09    199
15     Squash Court    07     23
16     Squash Court    08     85
17     Squash Court    09     87
18     Table Tennis    07     48
19     Table Tennis    08    143
20     Table Tennis    09    194
21   Tennis Court 1    07     65
22   Tennis Court 1    08    111
23   Tennis Court 1    09    132
24   Tennis Court 2    07     41
25   Tennis Court 2    08    109
26   Tennis Court 2    09    126